[
  {
    "number": 1,
    "heading": "Legal Protection",
    "description": "Registering a trademark provides legal protection against misuse of any kind including infringement or copy of a company’s name or logo, which is often a company’s most valuable asset. In case you doubt that your trademark is being copied by anyone else, you can take up the issue legally and sue them if you have registered your logo, brand name or slogan as a trademark.<br>It grants the trademark owner exclusive nationwide ownership of the mark which can be legally upheld in the courts of law in any part of the country."
  },
  {
    "number": 2,
    "heading": "Exclusive Unique Identity and Right",
    "description": "Registering a mark as a Trademark grants the mark owner the right to make the exclusive and incontestable and use it in a variety of mediums. Products/Services are identified by their logo which helps create brand value over time.<br>Registered Trademark works like an anchor for the existing customers as well as for the new customers. This will be immensely useful to prove the unique and validity identity of the product or service and the reserve the rights of the ownership in-case of any infringement by a third party."
  },
  {
    "number": 3,
    "heading": "Asset creation",
    "description": "A registered trademark is an intangible asset for a company as it helps generate more business and helps attract and retain customers by account of brand recognition. It can be commercially contracted, sold and franchised. It also helps in building up trust, reliability, quality, and goodwill in the minds of customers.<br>It also grants the business legal right to use a logo exclusively for 10 years with the choice to renew the registration."
  },
  {
    "number": 4,
    "heading": "International Trademark",
    "description": "A trademark which is registered and filed in India can also be filed in other countries outside India. Likewise, foreigners can also get a trademark registered in India."
  }
]
