[
  {
    "number": 1,
    "heading": "Commencement of Business",
    "description": "Companies which gets registered in India before commencing any business or exercising any borrowing powers shall have to file Form INC-20A a declaration for commencement of business within 180 days of Incorporation of the Company. Failure in filing such declaration for commencement of business will attracts the penalty of Rs. 50,000/- for the company and a penalty of Rs.1000/- per day for the each Directors till the default continues."
  },
  {
    "number": 2,
    "heading": "First Board of Directors Meeting and Auditor Appointment",
    "description": "The first board meeting of the directors shall be conducted within a period of 30 days of its Incorporation. And all the companies shall appoint the statutory Auditor also within 30 days from the date of its Incorporation. Failure to appoint an Auditor will attracts the penalty of Rs. 300/- per month and the company would not be allowed to commence business."
  },
  {
    "number": 3,
    "heading": "Issuance of Share Certificates",
    "description": "Issuance of share certificates to the shareholders is also an important requirement, and all details of such issuance of share certificate are required to be maintained and mentioned in the register of allotment."
  },
  {
    "number": 4,
    "heading": "Annual General Meeting",
    "description": "AGM is the meeting of shareholders/ subscribers of the company who shall meet atleast once in a year. It is required to be held within a period of 18 months from date of Incorporation or 9 months from the date of closing of financial year, whichever is earlier in case of newly incorporated company. Subsequent AGM shall be held within a period of 6 months from the closing of that financial year."
  },
  {
    "number": 5,
    "heading": "Annual return and Financial Statements",
    "description": "The Annual Return of the Company must be filed every financial year mandatorily by every registered company irrespective of its turnover or activities within 60 days from the date of Annual General Meeting and the Financial Statements are to be filed within 30 days from the date of Annual General Meeting. Failure to file Financial Statements in Form AOC-4 attracts a penalty of Rs.200/- per day of default or delay. Failure to file Annual Return in Form MGT-7 attracts a penalty of Rs. 200/- per day of default or delay."
  },
  {
    "number": 6,
    "heading": "Maintaining Statutory Registers",
    "description": "Maintaining the Statutory Registers under the Companies Act, 2013 are also the part of compliance under this Act and required to keep and maintain at its registered office in the prescribed form by all the companies incorporated under Companies Act, 2013. In case of any failure in maintaining the statutory register, the company, as well as directors, may be fined and prosecuted."
  },
  {
    "number": 7,
    "heading": "Income Tax Return",
    "description": "All companies registered in India shall file Income Tax Return on or before 30th September, 2020 for the Financial Year 2019-20. Failure to file Income Tax return attracts a penalty of Rs.10,000/-."
  },
  {
    "number": 8,
    "heading": "Directors KYC",
    "description": "Form DIR-3 KYC is allotted by the Ministry of Corporate Affairs for the KYC of the Director in which the directors of the company must provide and verify their unique personal mobile number and personal email address. In failure to this compliance it attracts the penalty of Rs. 5,000/- per DIN. Our compliance service includes preparation of Financial Statements, Secretarial and Regulatory services, Income Tax Return Filing and MCA annual return filing. Based on requirement, we can also provide GST return filing services, TDS filing services."
  }
]
