[
    {
      "number": 1,
      "heading": "TAX EXEMPTION",
      "description": "Donors who contribute to the Section 8 Company can claim the Tax exemption against their donations."
    },
    {
      "number": 2,
      "heading": "NO MINIMUM CAPITAL REQUIREMENT",
      "description": "No prescribed limit for the Incorporation of Section 8 Company, and also the capital structure can be altered at any point of time as per the Companies growth and requirement."
    },
    {
      "number": 3,
      "heading": "NO STAMP DUTY PAYABLE",
      "description": "A section 8 Company is exempted for the payment of stamp duty applicable at the time of Incorporation."
    },
    {
      "number": 4,
      "heading": "SEPARATE LEGAL ENTITY",
      "description": "Both members and company are separate entities as company is in itself a registered as a Legal Entity and it also has continuous existence members may come members may go but the company goes on forever."
    },
    {
      "number": 5,
      "heading": "RELIABLE AND CREDIBILITY",
      "description": "Section 8 Company has more reliability and credibility as compared to trust or society as it is regulated and governed by the Companies Act, 2013 and Ministry of Corporate Affairs."
    },
    {
      "number": 6,
      "heading": "DONATIONS/ FUNDING",
      "description": "Section 8 Company is not allowed to raise capitals by way of deposits but they can accept donations from the general public. There are some ways by which these companies can raise funding: <br /> <ol><li>Equity Funding: By issuing new equity at higher value these Companies can raise funds by issuing new equity shares at a higher value.</li><li>Foreign Donations: Only on FCRA (Foreign Contribution Regulation Act 1976) registration these companies can take foreign donations. Eligibility for FCRA license is it can be applied only after 3(three) years from the date of its Incorporation.</li><li>Domestic donations: There is no limitation to the domestic donations. But to avoid money laundering cases, a proper system must be laid down to keep them in check.</li></ol>"
    }
  ]
  